#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# &author: 漂移过弯  time: 2021/9/23 3:44 下午

# 系统字典


def class_type():
    # 班型
    order = ["班型ID", "班型名称", "申领类型", "班型费用", "适用报名点", "适用校区", "班型类型", "费用明细", "排序", "启用状态", "线上展示"]
    return order


def train_campus_type():
    # 训练场
    order = ["训练场ID", "关联校区", "校区ID", "训练场名称", "科目", "培训车型", "联系人", "联系电话", "地址", "纬度", "租户ID", "经度",
             "封面", "排序", "启用状态", "线上展示"]
    return order


def sign_up_list():
    # 报名点
    order = ["报名点ID", "报名点名称", "关联校区", "联系人", "电话", "地址", "经度", "纬度", "封面图", "启用状态", "线上展示"]
    return order


def department():
    # 报名点
    order = ["部门ID",
             "父部门ID",
             "部门名称",
             "部门联系人",
             "部门联系人电话",
             "部门排序",
             "部门层级"]
    return order


def role():
    # 报名点
    order = ["角色名称",
             "角色排序",
             "系统默认",
             "角色ID"]
    return order


def access():
    # 权限
    order = ["角色名称",
             "选中状态",
             "对照权限code",
             "对照权限名称"]
    return order


def staff_ultimate():
    order = ["员工ID",
             "头像",
             "姓名",
             "联系电话",
             "员工类型",
             "证件号",
             "出生日期",
             "性别",
             "部门名称",
             "岗位",
             "在职状态",
             "入职时间",
             "离职时间",
             "准驾车型",
             "联系地址",
             "劳动合同开始日期",
             "劳动合同结束日期",
             "角色名称",
             "优惠金额",
             "科目",
             "类型",
             "培训人数",
             "车牌号",
             "科二训练场",
             "科三训练场",
             "资格证号",
             "资格等级",
             "教龄",
             "准教车型",
             "教练组",
             "班型",
             "教练介绍",
             "车辆ID"
             ]
    return order


def staff():
    order = ["员工ID",
             "头像",
             "姓名",
             "联系电话",
             "员工类型",
             "证件号",
             "出生日期",
             "性别",
             "部门名称",
             "岗位",
             "在职状态",
             "入职时间",
             "离职时间",
             "准驾车型",
             "联系地址",
             "劳动合同开始日期",
             "劳动合同结束日期",
             "角色名称",
             "优惠金额",
             "科目",
             "类型",
             "培训人数",
             "车牌号",
             "科二训练场",
             "科三训练场",
             "资格证号",
             "资格等级",
             "教龄",
             "准教车型",
             "教练组",
             "班型",
             "教练介绍"
             ]
    return order


# 车辆信息
def car_info_original():
    order = ["车辆ID",
             "车牌号",
             "培训车型",
             "图片",
             "训练场",
             "品牌",
             "型号",
             "车辆状态",
             "车辆类型",
             "分组",
             "车辆颜色值",
             "技术等级名称",
             "购买时间",
             "车架号",
             "车辆用途",
             "发动机号",
             "油气卡号",
             "厂家",
             "出厂日期",
             "编号",
             "落牌时间",
             "备注"
             ]
    return order


# 车辆信息
def car_info_ultimate():
    order = ["车辆ID",
             "车牌号",
             "培训车型",
             "图片",
             "训练场",
             "品牌",
             "型号",
             "车辆状态",
             "车辆类型",
             "分组",
             "车辆颜色值",
             "技术等级名称",
             "购买时间",
             "车架号",
             "车辆用途",
             "发动机号",
             "油气卡号",
             "厂家",
             "出厂日期",
             "编号",
             "落牌时间",
             "备注",
             "年审到期时间",
             "商业险到期时间",
             "交强险到期时间",
             "钢瓶到期时间",
             "道路运输证年审时间"]
    return order


# 到期预警
def expire_warning():
    order = ["车牌号",
             "年审到期时间",
             "商业险到期时间",
             "交强险到期时间",
             "钢瓶到期时间",
             "道路运输证年审时间"]
    return order


def student_info():
    order = [
             '原学员编号',
             '学员姓名',
             '国籍',
             '民族',
             '性别',
             '证件类型',
             '证件号码',
             '联系电话',
             '联系电话2',
             '身份证地址',
             '居住地址',
             '邮箱',
             '班型',
             '报名日期',
             '业务类型',
             '原驾车型',
             '学员分组',
             '申领类型',
             '当前校区',
             '报名校区',
             '报名点',
             '训练场',
             '招生人',
             '学员状态',
             '招生来源',
             '自编号',
             '学驾编号',
             '报名前已学',
             '职业',
             '资料',
             '介绍人',
             '驾驶人来源',
             '科目一',
             '科目二',
             '科目三',
             '科目四',
             '备注',
             '备注2',
             '创建人',
             '创建时间',
             '体检时间',
             '预录入时间',
             '受理时间'
             ]
    return order


# 学员档案编号
def student_files_info():
    order = ['原学员编号', '档案号1', '档案号2', '档案号3', '档案号4', '档案时间1', '档案时间2', '档案时间3', '档案时间4']
    return order


def apply_type():
    order = ['A1', 'A2', 'A3', 'B1', 'B2', 'C1', 'C2', 'C3', 'C4', 'C5',
             'D', 'E', 'F', 'M', 'N', 'P']
    return order


def student_exam():
    # 如果旧系统有学员编号
    order = ['原学员编号',
             '学员姓名',
             '教练',
             '学驾证明编号',
             '考试科目',
             '预约日期',
             '考试日期',
             '考试场地',
             '考试场次',
             '考试次数',
             '合格状态',
             '考试备注',
             '补考缴费状态',
             '成绩']
    return order


def student_exam_ret():
    # 需要用原始系统的学员号关联
    order = ['学员号1',
             '原学员编号',
             '学员姓名',
             '教练',
             '学驾证明编号',
             '考试科目',
             '预约日期',
             '考试日期',
             '考试场地',
             '考试场次',
             '考试次数',
             '合格状态',
             '考试备注',
             '补考缴费状态',
             '成绩']
    return order


# scania导入 从业资格和继续教育
def further_edu():
    order = ['原学员编号',
             '学员姓名',
             '国籍',
             '性别',
             '证件类型',
             '证件号码',
             '联系电话',
             '联系电话2',
             '身份证地址',
             '居住地址',
             '邮箱',
             '报名日期',
             '业务类型',
             '原驾车型',
             '学员分组',
             '申领类型',
             '班型',
             '当前校区',
             '报名校区',
             '报名点',
             '训练场',
             '招生经办人',
             '学员状态',
             '招生来源',
             '备注',
             '备注2',
             '创建人',
             '创建时间',
             '体检时间',
             '预录入时间',
             '受理时间']
    return order


# 页面导入从业资格继续教育
def further_edu2():
    order = ['序号',
             '学员编号',
             '姓名',
             '证件类型',
             '证件号',
             '性别',
             '国籍',
             '民族',
             '联系电话',
             '出生日期',
             '备用电话',
             '电子邮箱',
             '职业',
             '驾驶人来源',
             '身份证地址',
             '居住地址',
             '报名时间',
             '业务类型',
             '申领类型',
             '班型',
             '报名校区',
             '报名点',
             '学员分组',
             '训练场',
             '招生来源',
             '招生经办人',
             '缴费点',
             '资料',
             '学员状态',
             '备注',
             '收费标准',
             '优惠金额',
             '支付方式',
             '实收金额',
             '欠费金额',
             '票号']
    return order


def cars_info():
    order = ['车辆ID',
             '车牌号',
             '培训车型',
             '图片',
             '训练场',
             '品牌',
             '型号',
             '车辆状态',
             '车辆类型',
             '分组',
             '车辆颜色值',
             '技术等级名称',
             '购买时间',
             '车架号',
             '车辆用途',
             '发动机号',
             '油气卡号',
             '厂家',
             '出厂日期',
             '编号',
             '落牌时间',
             '备注',
             '年审到期时间',
             '商业险到期时间',
             '交强险到期时间',
             '钢瓶到期时间',
             '道路运输证年审时间']
    return order


def cars_overtime_warning():
    order = ['车牌号',
             '年审到期时间',
             '商业险到期时间',
             '交强险到期时间',
             '钢瓶到期时间',
             '道路运输证年审时间']
    return order


def kaoqian_edt():
    order = ['id',
             'name',
             'idcard',
             'cellPhone',
             'carType',
             'applydate',
             'applyCampusId',
             'signupSpotId',
             'sex',
             'arrearageFee',
             'classesId',
             'course',
             'statusName',
             'stuCode',
             'introducerName',
             'medicalDate',
             'medicalStatus',
             'preliminaryDate',
             'preliminaryStatus',
             'acceptDate',
             'acceptStatus',
             'remarks']
    return order


def classtype_edt():
    order = ['priceItemsStr',
             'originalPrice',
             'campusName',
             'prePrice',
             'sort',
             'isActive',
             'signupSpotName',
             'dicTrainType',
             'price',
             'isShowOnline',
             'tenantId',
             'name',
             'id', ]
    return order


def stu_fenche():
    order = ['原学员编号',
             '学员姓名',
             '分车科目',
             '教练姓名',
             '首次上车时间',
             '分车状态',
             '分车方式',
             '备注',
             '创建人']
    return order


def operate_record():
    order = ['原学员编号',
             '操作',
             '日期'
             ]
    return order


# 车辆维修
def vehicle_repair():
    order = ['车辆',
             '维修人',
             '维修项目',
             '单价',
             '数量',
             '费用',
             '票据单号',
             '维修时间',
             '维修公司'
             ]
    return order


# 车辆保养
def vehicle_maintenance():
    order = ['车辆',
             '保养人',
             '保养项目',
             '单价',
             '数量',
             '费用',
             '票据单号',
             '保养时间',
             '保养公司'
             ]
    return order


# 车辆保养
def vehicle_oil_gas():
    order = ['车辆',
             '油气类型',
             '加油/气量(升)',
             '油/气单价(元)',
             '费用',
             '油气卡号',
             '油气卡余额',
             '发票号',
             '公里数',
             '加油/气人',
             '加油/气时间'
             ]
    return order


# 教练和教练信息
def coach():
    order = ['类型',
             '培训人数',
             '车辆ID',
             '所属训练队ID',
             '资格证号',
             '班型',
             '教练介绍',
             '科目',
             '准教车型',
             '资格等级',
             '手机号',
             '自动分车',
             '管理车辆',
             '教龄',
             '科二训练场ID',
             '科三训练场ID',
             '科二训练场',
             '科三训练场',
             '车牌号'
             ]
    return order


# 学员账单记录
def student_income_bill():
    order = ['序号',
             '单据编号',
             '收支类型',
             '账单类型',
             '学员编号',
             '账单来源',
             '账单状态',
             '审核状态',
             '账单款项',
             '款项标准',
             '款项优惠',
             '支付优惠',
             '款项实收/付',
             '款项待收/付',
             '款项呆账',
             '账单备注',
             '创建人',
             '创建时间']
    return order


# 学员收支流水
def student_income_flow():
    order = ['序号',
             '单据编号',
             '账单编号',
             '支付方式',
             '款项',
             '支付优惠',
             '实际金额',
             '支付日期',
             '经办人',
             '缴费点',
             '备注',
             '对账状态',
             '对账人',
             '对账时间',
             '手写票号']

    return order


# 财务款项配置

def payment_settings():
    order = ['款项配置ID',
             '款项类型',
             '款项名称',
             '款项对象',
             '收支类型',
             '收费标准',
             '是否可优惠',
             '启用状态']

    return order


# 学员状态配置
# edt的科四合格是结束状态

def status_list():
    order = ['结业',
             '退学',
             '五次不过',
             '档案过期',
             '转出',
             '换人',
             '科四合格',
             '预报名',
             '报名',
             '体检失败',
             '体检成功',
             '预录入',
             '受理失败',
             '受理成功',
             '归档',
             '站岗',
             '安全教育',
             '科一模拟合格',
             '科一约考',
             '科一取消约考',
             '科一失败',
             '科一缺考',
             '科一合格',
             '科二模拟合格',
             '科二约考',
             '科二取消约考',
             '科二失败',
             '科二缺考',
             '科二合格',
             '科三模拟合格',
             '科三约考',
             '科三取消约考',
             '科三失败',
             '科三缺考',
             '科三合格',
             '科四模拟合格',
             '科四约考',
             '科四取消约考',
             '科四失败',
             '科四缺考']

    return order


def furquastatus_list():
    order = ['合格',
             '退学',
             '预报名',
             '报名']

    return order


def status_list_ecp():
    order = ['退学',
             '五次不过',
             '档案过期',
             '转出',
             '科四合格',
             '换人'
             ]
    return order
